[HackRewardBuffEnemy X2AbilityTemplate]
LocFriendlyName="电子反噬"
LocLongDescription="失败的侵入使目标+<Ability:SUPERCHARGE_AIM_BONUS/>命中，+<Ability:SUPERCHARGE_DEFENSE_BONUS>防御和+<Ability:SUPERCHARGE_HACK_DEFENSE_CHANGE/>黑客防御。"

[BuffEnemy X2HackRewardTemplate]
FriendlyName="超级充能"
Description="失败的侵入将会在眩晕目标之后增加该目标命中和防御以及黑客防御。"

[ShutdownRobot X2HackRewardTemplate]
FriendlyName="控制敌人"
Description="暂时控制该单位。"

[ControlRobot X2HackRewardTemplate]
FriendlyName="高级敌人控制"
Description="暂时控制该单位，并在此期间提升其命中，移动力和暴击率。"

[ShutdownTurret X2HackRewardTemplate]
FriendlyName="控制炮塔"
Description="暂时控制该自动炮塔。"

[ControlTurret X2HackRewardTemplate]
FriendlyName="高级炮塔控制"
Description="暂时控制该自动炮塔，并在此期间提升其命中和暴击率。"